import { z } from "zod";

export const loginSchema = z.object({
    username: z.string()
        .min(2, "اسم المستخدم يجب أن يكون على الأقل حرفين")
        .max(100, "اسم المستخدم طويل جدًا"),
    password: z.string()
        .min(8, "كلمة المرور يجب أن تكون 8 أحرف على الأقل")
        .max(100, "كلمة المرور طويلة جدًا")
        .regex(
            /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[@$!%*?&])[A-Za-z\d@$!%*?&]{8,}$/,
            "كلمة المرور يجب أن تحتوي على حرف كبير وحرف صغير ورقم ورمز خاص واحد على الأقل"
        ),
});